{
    "cms": {
        "title":"Content Management",
        "content":"Effective content management is crucial for VachanOnline.com and the VachanGo app, the leading Scripture Engagement platform in Indian Languages. With a streamlined content management system, administrators can organize and distribute diverse resources, including commentaries, videos, audio bibles, and reading plans. This system facilitates seamless integration of new content and ensures a wide range of offerings in multiple Indian languages. It also enables efficient management of user-generated content, fostering an interactive community of users. Content management plays a pivotal role in maintaining a dynamic and enriching Scripture Engagement experience for users.",
        "links":[
            {
                "link":"https://vachanonline.com/",
                "linkname":"Vachan Online",
                "button":false
            },

            {
                "link":"https://play.google.com/store/apps/details?id=com.bridgeconn.vachango&amp;pli=1",
                "linkname":"Vachan Go",
                "button":false
            }
        ]
    },
    "translation": {
        "title":"Translation APIs",
        "content":"Translation APIs are primarily designed for text translation but are now also being experimented with for sign language translation. These APIs typically rely on vocabulary-based translation techniques and token replacement methods. They excel in handling very low-resource languages and languages that are closely related. Additionally, these APIs offer translation memory and context-aware suggestion capabilities, enhancing the quality and accuracy of translations. Whether it's cloud-based projects or local projects, these translation APIs can seamlessly integrate and support various implementation scenarios. Their versatility and capabilities make them valuable tools for enabling effective language translation in a wide range of applications.",
        "links":[
            {
                "link":"https://isl.bridgeconn.com/",
                "linkname":"IntelliSign",
                "button":false

            }
        ]
    },
    "ai": {
        "title":"AI APIs",
        "content":"AI APIs are essential for various AI functionalities. They empower applications with model selection, text and document translation, and speech-to-text transcription capabilities. Vachan-mt-nllb APIs use NLLB(No Language Left Behind) models, sourced from meta for text translation. These models offer evaluated, high-quality translations among 200 languages, including low-resource languages. We are actively fine-tuning these models to support our specific use-cases. The Model Selection API retrieves nllb model details, Text Translation API supports translation into 200 languages and Document Translation API translates lists of sentences. Vachan-st-xlsr APIs are used to transcribe speech into text using machine learning models using ST-XLSR(Streaming Transformer -Cross-lingual Speech Recognition) model. It has the Model Selection API retrieves Speech to text and Language model details and The Transcribe API converts audio to text, supporting multiple languages. Current STT models use xlsr, with plans to transition to MMS models supporting 1000+ languages."
    },
    "auth": {
        "title":"Auth & Access Management",
        "content":"Access Restriction is implemented for all the endpoints in different levels based on the API’s content priority. User level, Content level, Application level-based security is added to each endpoint. Some of the endpoints are open accessible and others are restricted to user-roles only. User with specific role permission can only access those APIs. Access to endpoints can be done with the help of authorized token. The security implemented for the Vachan Engine contents are based on Role Based Access Control (RBAC) Auwhich restricts the access based on user's role, access-tags etc.",
        "links":[
            {
                "link":"https://github.com/Bridgeconn/vachan-api/blob/version-2/docs/AccessManagement-RBAC.md",
                "linkname":"Access Management",
                "button":false
            },

            {
                "link":"https://github.com/Bridgeconn/vachan-api/blob/version-2/app/auth/api-permissions.csv",
                "linkname":"API Permissions",
                "button":false
            },

            {
                "link":"https://github.com/Bridgeconn/vachan-api/blob/version-2/app/auth/access_rules.json",
                "linkname":"Access Rules",
                "button":false
            }
        ]
    },
    "graphql": {
        "title":"GraphQL",
        "content":"GraphQL module for Vachan Engine is a specification for web APIs that offers a compelling alternative to REST. This module serves as a middle layer between client applications and data sources. With its powerful query language, GraphQL enables declarative data fetching, eliminating the need for over-fetching or under-fetching. Initially implemented using Graphene, we are now migrating to the Strawberry library, ensuring access to the latest GraphQL advancements. It is hosted alongside our REST API services, this integration allows you to leverage the best of both worlds. While REST provides familiar GET, PUT, and POST endpoints, GraphQL empowers you with flexible and precise data retrieval."        
    },
    "microservices": {
        "title":"Micro Services",
        "content":"Vachan Engine microservices architecture is broken down into a set of independently functioning services, each serving a specific business capability. These services communicate with each other through well-defined APIs, typically using lightweight protocols such as HTTP or messaging systems.",
        "links":[
            {
                "link":"https://miro.com/app/board/uXjVMHjqZ10=/?share_link_id=841173118462",
                "linkname":"Microservices",
                "button":false
            }
        ]
    }
}